Q1
Rainfall dataset

In [101]:
import numpy as np
import pandas as pd

data = pd.read_csv('dataset/district wise rainfall normal.csv')
# data.info()


#Check for missing values
data.isnull().sum()

#District with highest annual rainfall
print('District with highest annual rainfall is',data['DISTRICT'][data['ANNUAL'].idxmax()],'\n')

#top states with highest annual rainfall
top_5 = data[['STATE_UT_NAME','ANNUAL']].sort_values(by = 'ANNUAL',ascending=False,).head(5)
print('Top 5 states with highest annual rainfall are')
top_5

District with highest annual rainfall is TAMENGLONG

Top 5 states with highest annual rainfall are

         STATE_UT_NAME  ANNUAL
55             MANIPUR  7229.3
47           MEGHALAYA  6379.9
46           MEGHALAYA  6166.1
12   ARUNACHAL PRADESH  4402.1
598          KARNATAKA  4306.0

In [100]:
#drop the columns which are not required
drop_data = data.drop(['Jan-Feb','Mar-May','Jun-Sep','Oct-Dec'],axis=1)
print('Data after dropping the columns which are not required')
drop_data.head()

Data after dropping the columns which are not required

,STATE_UT_NAME,DISTRICT,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL
0,ANDAMAN And NICOBAR ISLANDS,NICOBAR,107.3,57.9,65.2,117.0,358.5,295.5,285.0,271.9,354.8,326.0,315.2,250.9,2805.2
1,ANDAMAN And NICOBAR ISLANDS,SOUTH ANDAMAN,43.7,26.0,18.6,90.5,374.4,457.2,421.3,423.1,455.6,301.2,275.8,128.3,3015.7
2,ANDAMAN And NICOBAR ISLANDS,N & M ANDAMAN,32.7,15.9,8.6,53.4,343.6,503.3,465.4,460.9,454.8,276.1,198.6,100.0,2913.3
3,ARUNACHAL PRADESH,LOHIT,42.2,80.8,176.4,358.5,306.4,447.0,660.1,427.8,313.6,167.1,34.1,29.8,3043.8
4,ARUNACHAL PRADESH,EAST SIANG,33.3,79.5,105.9,216.5,323.0,738.3,990.9,711.2,568.0,206.9,29.5,31.7,4034.7

In [ ]:
table = pd.pivot_table(drop_data, values='ANNUAL', index=['STATE_UT_NAME'], aggfunc=np.mean)
print('Pivot table for average annual rainfall in each state')
table

In [104]:
dis_count = drop_data.groupby('STATE_UT_NAME')['DISTRICT'].count()
dis_count

STATE_UT_NAME
ANDAMAN And NICOBAR ISLANDS     3
ANDHRA PRADESH                 23
ARUNACHAL PRADESH              16
ASSAM                          27
BIHAR                          38
CHANDIGARH                      1
CHATISGARH                     18
DADAR NAGAR HAVELI              1
DAMAN AND DUI                   2
DELHI                           9
GOA                             2
GUJARAT                        26
HARYANA                        21
HIMACHAL                       12
JAMMU AND KASHMIR              22
JHARKHAND                      24
KARNATAKA                      30
KERALA                         14
LAKSHADWEEP                     1
MADHYA PRADESH                 50
MAHARASHTRA                    35
MANIPUR                         9
MEGHALAYA                       7
MIZORAM                         9
NAGALAND                       11
ORISSA                         30
PONDICHERRY                     4
PUNJAB                         20
RAJASTHAN                      33
SIKKIM                          4
TAMIL NADU                     32
TRIPURA                         4
UTTAR PRADESH                  71
UTTARANCHAL                    13
WEST BENGAL                    19
Name: DISTRICT, dtype: int64

In [ ]:
#District with highest rainfall in may of every state
print('District with highest rainfall in may of every state')
drop_data.groupby('STATE_UT_NAME')[['DISTRICT','MAY']].apply(lambda x: x.loc[x['MAY'].idxmax()])

Q2 world alcohol consumption dataset

In [ ]:
data = pd.read_excel('dataset/world_alcohol.xlsx')
df_nan = data.dropna()
print('data without nan values')
df_nan

In [ ]:
df_na = data.isna()
print('data with nan values')
df_na

In [ ]:
new_data = data.dropna()
print('data after dropping nan values')
new_data

In [ ]:
data_mean = data['Display Value'].mean()
print('data after filling nan values with mean')
data.fillna(data_mean)

In [ ]:
print('data after filling nan values with 1.5')
data['Display Value'].fillna('1.5')

In [ ]:
for i in range(1,len(data),5):
    print(data.iloc[i,:],'\n')

# print(data.iloc[1,:])

In [ ]:
renamed_data = data.rename(columns={'Country':'Location'})
print('data after renaming the column country into location')
renamed_data

In [ ]:
r_data = data.rename(columns={'Year':'Time','WHO region':'continent','Country':'Location','Beverage Types':'Types','Display Value':'Value'})
print('data after renaming the all columns')
r_data

In [ ]:
f_data = data.filter(regex='[0]',axis=0)
print('data after filtering the rows which contains 0 in the end')
f_data

In [156]:
avg_consumption = data[(data['Beverage Types']=='Wine') & (data['Display Value'] > 2)]
print('Average consumption of wine where consumption is more than 2')
avg_consumption['Display Value'].mean()

Average consumption of wine where consumption is more than 2

5.006666666666667